{
  "status": "new",
  "body": "This is pretty obscure but I am fairly sure there is something not quite right here.\r\n\r\nEnsure \"Allow only sensible choices\" is ON.\r\n\r\nStart a game with Tormod's Crypt in your hand and play it immediately and tap. The card is sent to the stack and automatically resolved against the AI player without requiring you to choose a player. Another one of those \"what just happened\" moments (for me, anyway).\r\n\r\nNow, set \"Allow only sensible choices\" to OFF.\r\n\r\nDo the same thing, this time it will ask you to select a player and this time you can select yourself and Tormod's Crypt will be sent to exile from your graveyard. That particular play is not possible when the setting is ON.  It seems to me that \"Allow only sensible choices\" should not apply when the choice in question is choosing a player.",
  "author": "[lodici123](https://code.google.com/u/lodici123/)",
  "title": "Tormod's Crypt & \"Automatically pass priority\"",
  "labels": [
    "imported",
    "Priority-Medium",
    "bug"
  ],
  "comments": [
    {
      "date": "September 12, 2014 06:57:22",
      "body": "Generally exiling your graveyard would be seen as a 'bad' thing, something that you'd be more likely to do to your opponent.\r\n\r\nThe crypt would be exiled from your graveyard if you target yourself. The effect goes to the stack, not the permanent. The permanent is sacrificed as a cost, before the effect resolves.\r\n\r\nChoosing a player would still need 'sensible' choices. \"Target player sacrifices/discards...\", \"Deal X damage to target player\" etc.\r\n\r\nI tend to always have the choices option off. But the AI needs these prompts to save considering every possible option.",
      "author": "[ShawnieBoyUK](https://code.google.com/u/ShawnieBoyUK/)"
    },
    {
      "date": "September 12, 2014 08:53:55",
      "body": "Ok, thanks - if it is not a sensible thing to do then I guess the behaviour makes sense although I do think there is room for improvement in how the UI communicates this to the player.",
      "author": "[lodici123](https://code.google.com/u/lodici123/)"
    },
    {
      "date": "September 12, 2014 11:07:55",
      "body": "I agree with you there - Maybe even if the option for the player is 'turned off' for single player target spells and abilities. Or even where there's only one possible target - does make it more clear what is going on if you make that choice, even where there's not other options.\r\n\r\nI would be more in favor of removing the \"Allow only sensible choices\" entirely. Sometimes non-'sensible' choices are the correct plays to make.\r\n\r\nUsing Tormod's Crypt as an example: Haunting Apparition, Consuming Aberration. I'd want to exile my graveyard against these cards.",
      "author": "[ShawnieBoyUK](https://code.google.com/u/ShawnieBoyUK/)"
    }
  ],
  "content": "_From [lodici123](https://code.google.com/u/lodici123/) on September 12, 2014 16:47:26_\n\nThis is pretty obscure but I am fairly sure there is something not quite right here.\r\n\r\nEnsure \"Allow only sensible choices\" is ON.\r\n\r\nStart a game with Tormod's Crypt in your hand and play it immediately and tap. The card is sent to the stack and automatically resolved against the AI player without requiring you to choose a player. Another one of those \"what just happened\" moments (for me, anyway).\r\n\r\nNow, set \"Allow only sensible choices\" to OFF.\r\n\r\nDo the same thing, this time it will ask you to select a player and this time you can select yourself and Tormod's Crypt will be sent to exile from your graveyard. That particular play is not possible when the setting is ON.  It seems to me that \"Allow only sensible choices\" should not apply when the choice in question is choosing a player.\n\n_Original issue: http://code.google.com/p/magarena/issues/detail?id=689_",
  "date": "2014-09-12T16:47:26",
  "state": "open",
  "gid": 689,
  "link": "http://code.google.com/p/magarena/issues/detail?id=689",
  "owner": ""
}
